cask 'java'
cask 'enpass'

tap 'phrase/brewed'
tap 'adoptopenjdk/openjdk'
tap 'homebrew/cask-versions'

brew 'asciidoc'
brew 'cheat'
brew 'cloc'
brew 'diff-so-fancy'
brew 'fish'
brew 'git-extras'
brew 'ncurses'
brew 'htop'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'httpie'
brew 'imagemagick'
brew 'jenv'
brew 'jq'
brew 'macvim'
brew 'maven@3.3'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'sbt'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'youtube-dl'
brew 'tree'
brew 'gradle'
brew 'mas'
brew 'z'
brew 'fzy'
brew 'ripgrep'
brew 'trash'
brew 'ranger'
brew 'fd'
brew 'fzf'
brew 'phraseapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Apps
cask 'aerial'
cask 'alfred'
cask 'evernote'
cask 'google-chrome'
cask 'firefox'
cask 'iterm2'
cask 'virtualbox'
cask 'vlc'
cask 'spectacle'
cask 'steam'
cask 'charles'
cask 'amazon-photos'
cask 'gimp'
cask 'intellij-idea'
cask 'atom'
cask 'spideroakone'
cask 'wkhtmltopdf'
cask 'postgres'
cask 'google-chat'
cask 'adoptopenjdk8'

# Install Mac App Store apps
mas 'irvue', id: 1039633667
mas 'The Unarchiver', id: 425424353
mas 'Microsoft Remote Desktop', id: 715768417
