tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'java'
cask 'java7'
cask 'elm-platform'

brew 'asciidoc'
brew 'cheat'
brew 'cloc'
brew 'cmake'
brew 'ctags'
brew 'diff-so-fancy'
brew 'fish'
brew 'git-extras'
brew 'homebrew/dupes/ncurses'
brew 'htop'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'httpie'
brew 'imagemagick'
brew 'jenv'
brew 'jq'
brew 'lua'
brew 'python'
brew 'macvim', args: ['with-lua', 'with-override-system-vim']
brew 'maven'
brew 'mongodb'
brew 'nvm'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'sbt'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'youtube-dl'
brew 'homebrew/versions/node4-lts'
brew 'tree'
brew 'gradle'
brew 'mas'

# Quicklook
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Apps
cask 'aerial'
cask 'alfred'
cask 'evernote'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'firefox-esr'
cask 'opera'
cask 'iterm2'
cask 'mattermost'
cask 'virtualbox'
cask 'vlc'
cask 'spectacle'
cask 'steam'
cask 'charles'
cask 'amazon-drive'
cask 'gimp'
cask 'sketch'
cask 'intellij-idea'
cask 'atom'


# Install Mac App Store apps
mas 'irvue', id: 1039633667
mas 'minimetro', id: 1047760200
mas 'The Unarchiver', id: 425424353
