brew 'asdf'
brew 'uv'
brew 'llm'
brew 'bat'
brew 'glow'
brew 'gh'
brew 'yt-dlp'
brew 'rg'
brew 'localtunnel'
brew 'trash'
cask 'vibetunnel'
cask 'tailscale'
brew 'htop'
brew 'watchman'
brew 'fastfetch'
brew 'ffmpeg'
brew 'pandoc'
brew 'steipete/tap/summarize'
brew 'steipete/tap/bird'
brew 'tmux'
brew 'hcloud'

# DB
tap 'mongodb/brew'
brew 'mongodb-database-tools'
cask 'mongodb-compass'
brew 'mongosh'
brew 'postgresql@17'

# CLI Agents
cask 'codex'
brew 'sst/tap/opencode'
cask 'repo-prompt'
tap 'steipete/tap'
brew 'peekaboo'
cask 'claude-code'
tap 'farion1231/ccswitch'
cask 'cc-switch'
brew 'gemini-cli'
cask 'steipete/tap/codexbar'

# Apps
cask 'slack'
cask 'google-chrome'
cask 'rectangle'
cask 'warp'
cask 'docker-desktop'
cask 'visual-studio-code@insiders'
cask 'google-drive'
cask 'google-cloud-sdk'
cask 'Raycast'
cask 'brave-browser'
cask 'expo-orbit'
cask 'microsoft-edge'
cask 'figma'
cask 'enpass'
cask 'claude'
cask 'lm-studio'
cask 'android-studio'
cask 'zulu@17'
cask 'vlc'
cask 'gimp'
cask 'blender'
cask 'productdevbook/tap/portkiller'
cask 'keycastr'
cask 'fastrepl/hyprnote/hyprnote@nightly'

